app/Controllers/Productos.php

SELECT *
FROM `productos`
ORDER BY `id` DESC
---
    public function index(){
        $producto= new Producto();
        $datos['productos']=$producto->orderBy('id','DESC')->findAll();

SELECT *
FROM `productos`
WHERE `id` = '13'
 LIMIT 1
DELETE FROM `productos`
WHERE `id` = '13'
AND `id` IN ('13')
---
    public function borrar($id=null){
        $producto= new Producto();
        $datosProducto= $producto->where('id',$id)->first();

        $ruta=('../public/uploads/'.$datosProducto['imagen']);
        unlink($ruta);
        $producto->where('id',$id)->delete($id);

SELECT *
FROM `productos`
WHERE `id` = '10'
 LIMIT 1
---
    public function editar($id=null){
        $producto= new Producto();
        $datos['producto']=$producto->where('id',$id)->first();